package InterviewDirectory.sougou2019;

/**
 * Created by huali on 2018/9/14.
 */
public class juzhenjisuanqi {
    //矩阵计算器
    //我们想要实现一个简单的矩阵计算器，能够计算一些表达式值，支持的操作最高维数为2维，每个元素都是整型。操作数示例：
    //0维标量：一个数字，例如：
    //1
    //12
    //1维或2维矩阵，其中一维可以认为是一个二维矩阵中一个维度为1
    //整个矩阵由中括号包围，使用英文逗号，
    //
    //输入：[1,2]*[3;4] = 1*3+2*4 = 11
    //输出： 11
    //
    //2*([1;2]*[3,4])+[1,2;3,4] = 2*[3,4;6,8] + [1,2;3,4] = [7,10;15,20]
    //[7,10;15,20]
    //
    //[2,3]+[4;5]
    //Error
    public static void main(String[] args)
    {

    }
}